{"modelTopology": {"backend": "tensorflow", "training_config": {"loss": "categorical_crossentropy", "optimizer_config": {"class_name": "Adam", "config": {"epsilon": 1e-07, "beta_2": 0.9990000128746033, "beta_1": 0.8999999761581421, "amsgrad": false, "decay": 0.0, "lr": 0.0006249999860301614}}, "metrics": ["categorical_accuracy", "top_2_accuracy", "top_3_accuracy"], "loss_weights": null, "weighted_metrics": null, "sample_weight_mode": null}, "keras_version": "2.1.6-tf", "model_config": {"class_name": "Model", "config": {"output_layers": [["dense", 0, 0]], "name": "model", "layers": [{"inbound_nodes": [], "name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "name": "input_1", "dtype": "float32", "sparse": false}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv1_pad", "class_name": "ZeroPadding2D", "config": {"padding": [[0, 1], [0, 1]], "name": "conv1_pad", "data_format": "channels_last", "dtype": "float32", "trainable": false}}, {"inbound_nodes": [[["conv1_pad", 0, 0, {}]]], "name": "conv1", "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last", "activity_regularizer": null, "padding": "valid", "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "activation": "linear", "kernel_size": [3, 3], "dtype": "float32", "use_bias": false, "kernel_regularizer": null, "name": "conv1", "strides": [2, 2], "filters": 32, "trainable": false}}, {"inbound_nodes": [[["conv1", 0, 0, {}]]], "name": "conv1_bn", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "center": true, "axis": [3], "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "dtype": "float32", "scale": true, "name": "conv1_bn", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": false}}, {"inbound_nodes": [[["conv1_bn", 0, 0, {}]]], "name": "conv1_relu", "class_name": "ReLU", "config": {"dtype": "float32", "name": "conv1_relu", "trainable": false, "max_value":6, "threshold": {"type": "ndarray", "value": 0.0}, "negative_slope": {"type": "ndarray", "value": 0.0}}}, {"inbound_nodes": [[["conv1_relu", 0, 0, {}]]], "name": "conv_dw_1", "class_name": "DepthwiseConv2D", "config": {"dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last", "depthwise_constraint": null, "depthwise_regularizer": null, "padding": "same", "depth_multiplier": 1, "bias_constraint": null, "bias_regularizer": null, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "activation": "linear", "kernel_size": [3, 3], "dtype": "float32", "use_bias": false, "name": "conv_dw_1", "strides": [1, 1], "activity_regularizer": null, "trainable": false}}, {"inbound_nodes": [[["conv_dw_1", 0, 0, {}]]], "name": "conv_dw_1_bn", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "center": true, "axis": [3], "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "dtype": "float32", "scale": true, "name": "conv_dw_1_bn", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": false}}, {"inbound_nodes": [[["conv_dw_1_bn", 0, 0, {}]]], "name": "conv_dw_1_relu", "class_name": "ReLU", "config": {"dtype": "float32", "name": "conv_dw_1_relu", "trainable": false, "max_value":6, "threshold": {"type": "ndarray", "value": 0.0}, "negative_slope": {"type": "ndarray", "value": 0.0}}}, {"inbound_nodes": [[["conv_dw_1_relu", 0, 0, {}]]], "name": "conv_pw_1", "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "activation": "linear", "kernel_size": [1, 1], "dtype": "float32", "use_bias": false, "kernel_regularizer": null, "name": "conv_pw_1", "strides": [1, 1], "filters": 64, "trainable": false}}, {"inbound_nodes": [[["conv_pw_1", 0, 0, {}]]], "name": "conv_pw_1_bn", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "center": true, "axis": [3], "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "dtype": "float32", "scale": true, "name": "conv_pw_1_bn", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": false}}, {"inbound_nodes": [[["conv_pw_1_bn", 0, 0, {}]]], "name": "conv_pw_1_relu", "class_name": "ReLU", "config": {"dtype": "float32", "name": "conv_pw_1_relu", "trainable": false, "max_value":6, "threshold": {"type": "ndarray", "value": 0.0}, "negative_slope": {"type": "ndarray", "value": 0.0}}}, {"inbound_nodes": [[["conv_pw_1_relu", 0, 0, {}]]], "name": "conv_pad_2", "class_name": "ZeroPadding2D", "config": {"padding": [[0, 1], [0, 1]], "name": "conv_pad_2", "data_format": "channels_last", "dtype": "float32", "trainable": false}}, {"inbound_nodes": [[["conv_pad_2", 0, 0, {}]]], "name": "conv_dw_2", "class_name": "DepthwiseConv2D", "config": {"dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last", "depthwise_constraint": null, "depthwise_regularizer": null, "padding": "valid", "depth_multiplier": 1, "bias_constraint": null, "bias_regularizer": null, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "activation": "linear", "kernel_size": [3, 3], "dtype": "float32", "use_bias": false, "name": "conv_dw_2", "strides": [2, 2], "activity_regularizer": null, "trainable": false}}, {"inbound_nodes": [[["conv_dw_2", 0, 0, {}]]], "name": "conv_dw_2_bn", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "center": true, "axis": [3], "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "dtype": "float32", "scale": true, "name": "conv_dw_2_bn", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": false}}, {"inbound_nodes": [[["conv_dw_2_bn", 0, 0, {}]]], "name": "conv_dw_2_relu", "class_name": "ReLU", "config": {"dtype": "float32", "name": "conv_dw_2_relu", "trainable": false, "max_value":6, "threshold": {"type": "ndarray", "value": 0.0}, "negative_slope": {"type": "ndarray", "value": 0.0}}}, {"inbound_nodes": [[["conv_dw_2_relu", 0, 0, {}]]], "name": "conv_pw_2", "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "activation": "linear", "kernel_size": [1, 1], "dtype": "float32", "use_bias": false, "kernel_regularizer": null, "name": "conv_pw_2", "strides": [1, 1], "filters": 128, "trainable": false}}, {"inbound_nodes": [[["conv_pw_2", 0, 0, {}]]], "name": "conv_pw_2_bn", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "center": true, "axis": [3], "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "dtype": "float32", "scale": true, "name": "conv_pw_2_bn", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": false}}, {"inbound_nodes": [[["conv_pw_2_bn", 0, 0, {}]]], "name": "conv_pw_2_relu", "class_name": "ReLU", "config": {"dtype": "float32", "name": "conv_pw_2_relu", "trainable": false, "max_value":6, "threshold": {"type": "ndarray", "value": 0.0}, "negative_slope": {"type": "ndarray", "value": 0.0}}}, {"inbound_nodes": [[["conv_pw_2_relu", 0, 0, {}]]], "name": "conv_dw_3", "class_name": "DepthwiseConv2D", "config": {"dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last", "depthwise_constraint": null, "depthwise_regularizer": null, "padding": "same", "depth_multiplier": 1, "bias_constraint": null, "bias_regularizer": null, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "activation": "linear", "kernel_size": [3, 3], "dtype": "float32", "use_bias": false, "name": "conv_dw_3", "strides": [1, 1], "activity_regularizer": null, "trainable": false}}, {"inbound_nodes": [[["conv_dw_3", 0, 0, {}]]], "name": "conv_dw_3_bn", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "center": true, "axis": [3], "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "dtype": "float32", "scale": true, "name": "conv_dw_3_bn", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": false}}, {"inbound_nodes": [[["conv_dw_3_bn", 0, 0, {}]]], "name": "conv_dw_3_relu", "class_name": "ReLU", "config": {"dtype": "float32", "name": "conv_dw_3_relu", "trainable": false, "max_value":6, "threshold": {"type": "ndarray", "value": 0.0}, "negative_slope": {"type": "ndarray", "value": 0.0}}}, {"inbound_nodes": [[["conv_dw_3_relu", 0, 0, {}]]], "name": "conv_pw_3", "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "activation": "linear", "kernel_size": [1, 1], "dtype": "float32", "use_bias": false, "kernel_regularizer": null, "name": "conv_pw_3", "strides": [1, 1], "filters": 128, "trainable": false}}, {"inbound_nodes": [[["conv_pw_3", 0, 0, {}]]], "name": "conv_pw_3_bn", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "center": true, "axis": [3], "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "dtype": "float32", "scale": true, "name": "conv_pw_3_bn", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": false}}, {"inbound_nodes": [[["conv_pw_3_bn", 0, 0, {}]]], "name": "conv_pw_3_relu", "class_name": "ReLU", "config": {"dtype": "float32", "name": "conv_pw_3_relu", "trainable": false, "max_value":6, "threshold": {"type": "ndarray", "value": 0.0}, "negative_slope": {"type": "ndarray", "value": 0.0}}}, {"inbound_nodes": [[["conv_pw_3_relu", 0, 0, {}]]], "name": "conv_pad_4", "class_name": "ZeroPadding2D", "config": {"padding": [[0, 1], [0, 1]], "name": "conv_pad_4", "data_format": "channels_last", "dtype": "float32", "trainable": false}}, {"inbound_nodes": [[["conv_pad_4", 0, 0, {}]]], "name": "conv_dw_4", "class_name": "DepthwiseConv2D", "config": {"dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last", "depthwise_constraint": null, "depthwise_regularizer": null, "padding": "valid", "depth_multiplier": 1, "bias_constraint": null, "bias_regularizer": null, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "activation": "linear", "kernel_size": [3, 3], "dtype": "float32", "use_bias": false, "name": "conv_dw_4", "strides": [2, 2], "activity_regularizer": null, "trainable": false}}, {"inbound_nodes": [[["conv_dw_4", 0, 0, {}]]], "name": "conv_dw_4_bn", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "center": true, "axis": [3], "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "dtype": "float32", "scale": true, "name": "conv_dw_4_bn", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": false}}, {"inbound_nodes": [[["conv_dw_4_bn", 0, 0, {}]]], "name": "conv_dw_4_relu", "class_name": "ReLU", "config": {"dtype": "float32", "name": "conv_dw_4_relu", "trainable": false, "max_value":6, "threshold": {"type": "ndarray", "value": 0.0}, "negative_slope": {"type": "ndarray", "value": 0.0}}}, {"inbound_nodes": [[["conv_dw_4_relu", 0, 0, {}]]], "name": "conv_pw_4", "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "activation": "linear", "kernel_size": [1, 1], "dtype": "float32", "use_bias": false, "kernel_regularizer": null, "name": "conv_pw_4", "strides": [1, 1], "filters": 256, "trainable": false}}, {"inbound_nodes": [[["conv_pw_4", 0, 0, {}]]], "name": "conv_pw_4_bn", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "center": true, "axis": [3], "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "dtype": "float32", "scale": true, "name": "conv_pw_4_bn", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": false}}, {"inbound_nodes": [[["conv_pw_4_bn", 0, 0, {}]]], "name": "conv_pw_4_relu", "class_name": "ReLU", "config": {"dtype": "float32", "name": "conv_pw_4_relu", "trainable": false, "max_value":6, "threshold": {"type": "ndarray", "value": 0.0}, "negative_slope": {"type": "ndarray", "value": 0.0}}}, {"inbound_nodes": [[["conv_pw_4_relu", 0, 0, {}]]], "name": "conv_dw_5", "class_name": "DepthwiseConv2D", "config": {"dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last", "depthwise_constraint": null, "depthwise_regularizer": null, "padding": "same", "depth_multiplier": 1, "bias_constraint": null, "bias_regularizer": null, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "activation": "linear", "kernel_size": [3, 3], "dtype": "float32", "use_bias": false, "name": "conv_dw_5", "strides": [1, 1], "activity_regularizer": null, "trainable": false}}, {"inbound_nodes": [[["conv_dw_5", 0, 0, {}]]], "name": "conv_dw_5_bn", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "center": true, "axis": [3], "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "dtype": "float32", "scale": true, "name": "conv_dw_5_bn", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": false}}, {"inbound_nodes": [[["conv_dw_5_bn", 0, 0, {}]]], "name": "conv_dw_5_relu", "class_name": "ReLU", "config": {"dtype": "float32", "name": "conv_dw_5_relu", "trainable": false, "max_value":6, "threshold": {"type": "ndarray", "value": 0.0}, "negative_slope": {"type": "ndarray", "value": 0.0}}}, {"inbound_nodes": [[["conv_dw_5_relu", 0, 0, {}]]], "name": "conv_pw_5", "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "activation": "linear", "kernel_size": [1, 1], "dtype": "float32", "use_bias": false, "kernel_regularizer": null, "name": "conv_pw_5", "strides": [1, 1], "filters": 256, "trainable": false}}, {"inbound_nodes": [[["conv_pw_5", 0, 0, {}]]], "name": "conv_pw_5_bn", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "center": true, "axis": [3], "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "dtype": "float32", "scale": true, "name": "conv_pw_5_bn", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": false}}, {"inbound_nodes": [[["conv_pw_5_bn", 0, 0, {}]]], "name": "conv_pw_5_relu", "class_name": "ReLU", "config": {"dtype": "float32", "name": "conv_pw_5_relu", "trainable": false, "max_value":6, "threshold": {"type": "ndarray", "value": 0.0}, "negative_slope": {"type": "ndarray", "value": 0.0}}}, {"inbound_nodes": [[["conv_pw_5_relu", 0, 0, {}]]], "name": "conv_pad_6", "class_name": "ZeroPadding2D", "config": {"padding": [[0, 1], [0, 1]], "name": "conv_pad_6", "data_format": "channels_last", "dtype": "float32", "trainable": false}}, {"inbound_nodes": [[["conv_pad_6", 0, 0, {}]]], "name": "conv_dw_6", "class_name": "DepthwiseConv2D", "config": {"dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last", "depthwise_constraint": null, "depthwise_regularizer": null, "padding": "valid", "depth_multiplier": 1, "bias_constraint": null, "bias_regularizer": null, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "activation": "linear", "kernel_size": [3, 3], "dtype": "float32", "use_bias": false, "name": "conv_dw_6", "strides": [2, 2], "activity_regularizer": null, "trainable": false}}, {"inbound_nodes": [[["conv_dw_6", 0, 0, {}]]], "name": "conv_dw_6_bn", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "center": true, "axis": [3], "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "dtype": "float32", "scale": true, "name": "conv_dw_6_bn", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": false}}, {"inbound_nodes": [[["conv_dw_6_bn", 0, 0, {}]]], "name": "conv_dw_6_relu", "class_name": "ReLU", "config": {"dtype": "float32", "name": "conv_dw_6_relu", "trainable": false, "max_value":6, "threshold": {"type": "ndarray", "value": 0.0}, "negative_slope": {"type": "ndarray", "value": 0.0}}}, {"inbound_nodes": [[["conv_dw_6_relu", 0, 0, {}]]], "name": "conv_pw_6", "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "activation": "linear", "kernel_size": [1, 1], "dtype": "float32", "use_bias": false, "kernel_regularizer": null, "name": "conv_pw_6", "strides": [1, 1], "filters": 512, "trainable": false}}, {"inbound_nodes": [[["conv_pw_6", 0, 0, {}]]], "name": "conv_pw_6_bn", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "center": true, "axis": [3], "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "dtype": "float32", "scale": true, "name": "conv_pw_6_bn", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": false}}, {"inbound_nodes": [[["conv_pw_6_bn", 0, 0, {}]]], "name": "conv_pw_6_relu", "class_name": "ReLU", "config": {"dtype": "float32", "name": "conv_pw_6_relu", "trainable": false, "max_value":6, "threshold": {"type": "ndarray", "value": 0.0}, "negative_slope": {"type": "ndarray", "value": 0.0}}}, {"inbound_nodes": [[["conv_pw_6_relu", 0, 0, {}]]], "name": "conv_dw_7", "class_name": "DepthwiseConv2D", "config": {"dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last", "depthwise_constraint": null, "depthwise_regularizer": null, "padding": "same", "depth_multiplier": 1, "bias_constraint": null, "bias_regularizer": null, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "activation": "linear", "kernel_size": [3, 3], "dtype": "float32", "use_bias": false, "name": "conv_dw_7", "strides": [1, 1], "activity_regularizer": null, "trainable": false}}, {"inbound_nodes": [[["conv_dw_7", 0, 0, {}]]], "name": "conv_dw_7_bn", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "center": true, "axis": [3], "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "dtype": "float32", "scale": true, "name": "conv_dw_7_bn", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": false}}, {"inbound_nodes": [[["conv_dw_7_bn", 0, 0, {}]]], "name": "conv_dw_7_relu", "class_name": "ReLU", "config": {"dtype": "float32", "name": "conv_dw_7_relu", "trainable": false, "max_value":6, "threshold": {"type": "ndarray", "value": 0.0}, "negative_slope": {"type": "ndarray", "value": 0.0}}}, {"inbound_nodes": [[["conv_dw_7_relu", 0, 0, {}]]], "name": "conv_pw_7", "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "activation": "linear", "kernel_size": [1, 1], "dtype": "float32", "use_bias": false, "kernel_regularizer": null, "name": "conv_pw_7", "strides": [1, 1], "filters": 512, "trainable": false}}, {"inbound_nodes": [[["conv_pw_7", 0, 0, {}]]], "name": "conv_pw_7_bn", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "center": true, "axis": [3], "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "dtype": "float32", "scale": true, "name": "conv_pw_7_bn", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": false}}, {"inbound_nodes": [[["conv_pw_7_bn", 0, 0, {}]]], "name": "conv_pw_7_relu", "class_name": "ReLU", "config": {"dtype": "float32", "name": "conv_pw_7_relu", "trainable": false, "max_value":6, "threshold": {"type": "ndarray", "value": 0.0}, "negative_slope": {"type": "ndarray", "value": 0.0}}}, {"inbound_nodes": [[["conv_pw_7_relu", 0, 0, {}]]], "name": "conv_dw_8", "class_name": "DepthwiseConv2D", "config": {"dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last", "depthwise_constraint": null, "depthwise_regularizer": null, "padding": "same", "depth_multiplier": 1, "bias_constraint": null, "bias_regularizer": null, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "activation": "linear", "kernel_size": [3, 3], "dtype": "float32", "use_bias": false, "name": "conv_dw_8", "strides": [1, 1], "activity_regularizer": null, "trainable": false}}, {"inbound_nodes": [[["conv_dw_8", 0, 0, {}]]], "name": "conv_dw_8_bn", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "center": true, "axis": [3], "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "dtype": "float32", "scale": true, "name": "conv_dw_8_bn", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": false}}, {"inbound_nodes": [[["conv_dw_8_bn", 0, 0, {}]]], "name": "conv_dw_8_relu", "class_name": "ReLU", "config": {"dtype": "float32", "name": "conv_dw_8_relu", "trainable": false, "max_value":6, "threshold": {"type": "ndarray", "value": 0.0}, "negative_slope": {"type": "ndarray", "value": 0.0}}}, {"inbound_nodes": [[["conv_dw_8_relu", 0, 0, {}]]], "name": "conv_pw_8", "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "activation": "linear", "kernel_size": [1, 1], "dtype": "float32", "use_bias": false, "kernel_regularizer": null, "name": "conv_pw_8", "strides": [1, 1], "filters": 512, "trainable": false}}, {"inbound_nodes": [[["conv_pw_8", 0, 0, {}]]], "name": "conv_pw_8_bn", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "center": true, "axis": [3], "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "dtype": "float32", "scale": true, "name": "conv_pw_8_bn", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": false}}, {"inbound_nodes": [[["conv_pw_8_bn", 0, 0, {}]]], "name": "conv_pw_8_relu", "class_name": "ReLU", "config": {"dtype": "float32", "name": "conv_pw_8_relu", "trainable": false, "max_value":6, "threshold": {"type": "ndarray", "value": 0.0}, "negative_slope": {"type": "ndarray", "value": 0.0}}}, {"inbound_nodes": [[["conv_pw_8_relu", 0, 0, {}]]], "name": "conv_dw_9", "class_name": "DepthwiseConv2D", "config": {"dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last", "depthwise_constraint": null, "depthwise_regularizer": null, "padding": "same", "depth_multiplier": 1, "bias_constraint": null, "bias_regularizer": null, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "activation": "linear", "kernel_size": [3, 3], "dtype": "float32", "use_bias": false, "name": "conv_dw_9", "strides": [1, 1], "activity_regularizer": null, "trainable": false}}, {"inbound_nodes": [[["conv_dw_9", 0, 0, {}]]], "name": "conv_dw_9_bn", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "center": true, "axis": [3], "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "dtype": "float32", "scale": true, "name": "conv_dw_9_bn", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": false}}, {"inbound_nodes": [[["conv_dw_9_bn", 0, 0, {}]]], "name": "conv_dw_9_relu", "class_name": "ReLU", "config": {"dtype": "float32", "name": "conv_dw_9_relu", "trainable": false, "max_value":6, "threshold": {"type": "ndarray", "value": 0.0}, "negative_slope": {"type": "ndarray", "value": 0.0}}}, {"inbound_nodes": [[["conv_dw_9_relu", 0, 0, {}]]], "name": "conv_pw_9", "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "activation": "linear", "kernel_size": [1, 1], "dtype": "float32", "use_bias": false, "kernel_regularizer": null, "name": "conv_pw_9", "strides": [1, 1], "filters": 512, "trainable": false}}, {"inbound_nodes": [[["conv_pw_9", 0, 0, {}]]], "name": "conv_pw_9_bn", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "center": true, "axis": [3], "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "dtype": "float32", "scale": true, "name": "conv_pw_9_bn", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": false}}, {"inbound_nodes": [[["conv_pw_9_bn", 0, 0, {}]]], "name": "conv_pw_9_relu", "class_name": "ReLU", "config": {"dtype": "float32", "name": "conv_pw_9_relu", "trainable": false, "max_value":6, "threshold": {"type": "ndarray", "value": 0.0}, "negative_slope": {"type": "ndarray", "value": 0.0}}}, {"inbound_nodes": [[["conv_pw_9_relu", 0, 0, {}]]], "name": "conv_dw_10", "class_name": "DepthwiseConv2D", "config": {"dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last", "depthwise_constraint": null, "depthwise_regularizer": null, "padding": "same", "depth_multiplier": 1, "bias_constraint": null, "bias_regularizer": null, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "activation": "linear", "kernel_size": [3, 3], "dtype": "float32", "use_bias": false, "name": "conv_dw_10", "strides": [1, 1], "activity_regularizer": null, "trainable": false}}, {"inbound_nodes": [[["conv_dw_10", 0, 0, {}]]], "name": "conv_dw_10_bn", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "center": true, "axis": [3], "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "dtype": "float32", "scale": true, "name": "conv_dw_10_bn", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": false}}, {"inbound_nodes": [[["conv_dw_10_bn", 0, 0, {}]]], "name": "conv_dw_10_relu", "class_name": "ReLU", "config": {"dtype": "float32", "name": "conv_dw_10_relu", "trainable": false, "max_value":6, "threshold": {"type": "ndarray", "value": 0.0}, "negative_slope": {"type": "ndarray", "value": 0.0}}}, {"inbound_nodes": [[["conv_dw_10_relu", 0, 0, {}]]], "name": "conv_pw_10", "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "activation": "linear", "kernel_size": [1, 1], "dtype": "float32", "use_bias": false, "kernel_regularizer": null, "name": "conv_pw_10", "strides": [1, 1], "filters": 512, "trainable": false}}, {"inbound_nodes": [[["conv_pw_10", 0, 0, {}]]], "name": "conv_pw_10_bn", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "center": true, "axis": [3], "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "dtype": "float32", "scale": true, "name": "conv_pw_10_bn", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": false}}, {"inbound_nodes": [[["conv_pw_10_bn", 0, 0, {}]]], "name": "conv_pw_10_relu", "class_name": "ReLU", "config": {"dtype": "float32", "name": "conv_pw_10_relu", "trainable": true, "max_value":6, "threshold": {"type": "ndarray", "value": 0.0}, "negative_slope": {"type": "ndarray", "value": 0.0}}}, {"inbound_nodes": [[["conv_pw_10_relu", 0, 0, {}]]], "name": "conv_dw_11", "class_name": "DepthwiseConv2D", "config": {"dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last", "depthwise_constraint": null, "depthwise_regularizer": null, "padding": "same", "depth_multiplier": 1, "bias_constraint": null, "bias_regularizer": null, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "activation": "linear", "kernel_size": [3, 3], "dtype": "float32", "use_bias": false, "name": "conv_dw_11", "strides": [1, 1], "activity_regularizer": null, "trainable": true}}, {"inbound_nodes": [[["conv_dw_11", 0, 0, {}]]], "name": "conv_dw_11_bn", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "center": true, "axis": [3], "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "dtype": "float32", "scale": true, "name": "conv_dw_11_bn", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true}}, {"inbound_nodes": [[["conv_dw_11_bn", 0, 0, {}]]], "name": "conv_dw_11_relu", "class_name": "ReLU", "config": {"dtype": "float32", "name": "conv_dw_11_relu", "trainable": true, "max_value":6, "threshold": {"type": "ndarray", "value": 0.0}, "negative_slope": {"type": "ndarray", "value": 0.0}}}, {"inbound_nodes": [[["conv_dw_11_relu", 0, 0, {}]]], "name": "conv_pw_11", "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "activation": "linear", "kernel_size": [1, 1], "dtype": "float32", "use_bias": false, "kernel_regularizer": null, "name": "conv_pw_11", "strides": [1, 1], "filters": 512, "trainable": true}}, {"inbound_nodes": [[["conv_pw_11", 0, 0, {}]]], "name": "conv_pw_11_bn", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "center": true, "axis": [3], "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "dtype": "float32", "scale": true, "name": "conv_pw_11_bn", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true}}, {"inbound_nodes": [[["conv_pw_11_bn", 0, 0, {}]]], "name": "conv_pw_11_relu", "class_name": "ReLU", "config": {"dtype": "float32", "name": "conv_pw_11_relu", "trainable": true, "max_value":6, "threshold": {"type": "ndarray", "value": 0.0}, "negative_slope": {"type": "ndarray", "value": 0.0}}}, {"inbound_nodes": [[["conv_pw_11_relu", 0, 0, {}]]], "name": "conv_pad_12", "class_name": "ZeroPadding2D", "config": {"padding": [[0, 1], [0, 1]], "name": "conv_pad_12", "data_format": "channels_last", "dtype": "float32", "trainable": true}}, {"inbound_nodes": [[["conv_pad_12", 0, 0, {}]]], "name": "conv_dw_12", "class_name": "DepthwiseConv2D", "config": {"dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last", "depthwise_constraint": null, "depthwise_regularizer": null, "padding": "valid", "depth_multiplier": 1, "bias_constraint": null, "bias_regularizer": null, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "activation": "linear", "kernel_size": [3, 3], "dtype": "float32", "use_bias": false, "name": "conv_dw_12", "strides": [2, 2], "activity_regularizer": null, "trainable": true}}, {"inbound_nodes": [[["conv_dw_12", 0, 0, {}]]], "name": "conv_dw_12_bn", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "center": true, "axis": [3], "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "dtype": "float32", "scale": true, "name": "conv_dw_12_bn", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true}}, {"inbound_nodes": [[["conv_dw_12_bn", 0, 0, {}]]], "name": "conv_dw_12_relu", "class_name": "ReLU", "config": {"dtype": "float32", "name": "conv_dw_12_relu", "trainable": true, "max_value":6, "threshold": {"type": "ndarray", "value": 0.0}, "negative_slope": {"type": "ndarray", "value": 0.0}}}, {"inbound_nodes": [[["conv_dw_12_relu", 0, 0, {}]]], "name": "conv_pw_12", "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "activation": "linear", "kernel_size": [1, 1], "dtype": "float32", "use_bias": false, "kernel_regularizer": null, "name": "conv_pw_12", "strides": [1, 1], "filters": 1024, "trainable": true}}, {"inbound_nodes": [[["conv_pw_12", 0, 0, {}]]], "name": "conv_pw_12_bn", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "center": true, "axis": [3], "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "dtype": "float32", "scale": true, "name": "conv_pw_12_bn", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true}}, {"inbound_nodes": [[["conv_pw_12_bn", 0, 0, {}]]], "name": "conv_pw_12_relu", "class_name": "ReLU", "config": {"dtype": "float32", "name": "conv_pw_12_relu", "trainable": true, "max_value":6, "threshold": {"type": "ndarray", "value": 0.0}, "negative_slope": {"type": "ndarray", "value": 0.0}}}, {"inbound_nodes": [[["conv_pw_12_relu", 0, 0, {}]]], "name": "conv_dw_13", "class_name": "DepthwiseConv2D", "config": {"dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last", "depthwise_constraint": null, "depthwise_regularizer": null, "padding": "same", "depth_multiplier": 1, "bias_constraint": null, "bias_regularizer": null, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "activation": "linear", "kernel_size": [3, 3], "dtype": "float32", "use_bias": false, "name": "conv_dw_13", "strides": [1, 1], "activity_regularizer": null, "trainable": true}}, {"inbound_nodes": [[["conv_dw_13", 0, 0, {}]]], "name": "conv_dw_13_bn", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "center": true, "axis": [3], "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "dtype": "float32", "scale": true, "name": "conv_dw_13_bn", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true}}, {"inbound_nodes": [[["conv_dw_13_bn", 0, 0, {}]]], "name": "conv_dw_13_relu", "class_name": "ReLU", "config": {"dtype": "float32", "name": "conv_dw_13_relu", "trainable": true, "max_value": 6, "threshold": {"type": "ndarray", "value": 0.0}, "negative_slope": {"type": "ndarray", "value": 0.0}}}, {"inbound_nodes": [[["conv_dw_13_relu", 0, 0, {}]]], "name": "conv_pw_13", "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "activation": "linear", "kernel_size": [1, 1], "dtype": "float32", "use_bias": false, "kernel_regularizer": null, "name": "conv_pw_13", "strides": [1, 1], "filters": 1024, "trainable": true}}, {"inbound_nodes": [[["conv_pw_13", 0, 0, {}]]], "name": "conv_pw_13_bn", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "center": true, "axis": [3], "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "dtype": "float32", "scale": true, "name": "conv_pw_13_bn", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true}}, {"inbound_nodes": [[["conv_pw_13_bn", 0, 0, {}]]], "name": "conv_pw_13_relu", "class_name": "ReLU", "config": {"dtype": "float32", "name": "conv_pw_13_relu", "trainable": true, "max_value": 6, "threshold": {"type": "ndarray", "value": 0.0}, "negative_slope": {"type": "ndarray", "value": 0.0}}}, {"inbound_nodes": [[["conv_pw_13_relu", 0, 0, {}]]], "name": "global_average_pooling2d", "class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d", "data_format": "channels_last", "dtype": "float32", "trainable": true}}, {"inbound_nodes": [[["global_average_pooling2d", 0, 0, {}]]], "name": "dropout", "class_name": "Dropout", "config": {"rate": 0.25, "dtype": "float32", "noise_shape": null, "name": "dropout", "seed": null, "trainable": true}}, {"inbound_nodes": [[["dropout", 0, 0, {}]]], "name": "dense", "class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null, "activity_regularizer": null, "units": 7, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "activation": "softmax", "dtype": "float32", "use_bias": true, "kernel_regularizer": null, "name": "dense", "trainable": true}}], "input_layers": [["input_1", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of4", "group1-shard2of4", "group1-shard3of4", "group1-shard4of4"], "weights": [{"name": "conv1/kernel", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "conv1_bn/gamma", "shape": [32], "dtype": "float32"}, {"name": "conv1_bn/beta", "shape": [32], "dtype": "float32"}, {"name": "conv1_bn/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "conv1_bn/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "conv_dw_1/depthwise_kernel", "shape": [3, 3, 32, 1], "dtype": "float32"}, {"name": "conv_dw_10/depthwise_kernel", "shape": [3, 3, 512, 1], "dtype": "float32"}, {"name": "conv_dw_10_bn/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_10_bn/beta", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_10_bn/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_10_bn/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_11/depthwise_kernel", "shape": [3, 3, 512, 1], "dtype": "float32"}, {"name": "conv_dw_11_bn/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_11_bn/beta", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_11_bn/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_11_bn/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_12/depthwise_kernel", "shape": [3, 3, 512, 1], "dtype": "float32"}, {"name": "conv_dw_12_bn/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_12_bn/beta", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_12_bn/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_12_bn/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_13/depthwise_kernel", "shape": [3, 3, 1024, 1], "dtype": "float32"}, {"name": "conv_dw_13_bn/gamma", "shape": [1024], "dtype": "float32"}, {"name": "conv_dw_13_bn/beta", "shape": [1024], "dtype": "float32"}, {"name": "conv_dw_13_bn/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "conv_dw_13_bn/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "conv_dw_1_bn/gamma", "shape": [32], "dtype": "float32"}, {"name": "conv_dw_1_bn/beta", "shape": [32], 